{
  "appName": {
    "message": {
      "en": "swagger-type-generator",
      "ko": "swagger-type-generator"
    },
    "description": {
      "en": "swagger chrome extension generate typescript, axios, fetch code",
      "ko": "스웨거 크롬 익스텐션으로 타입스크립트, axios, fetch 코드를 생성합니다"
    }
  },
  "appDesc": {
    "message": {
      "en": "swagger chrome extension generate typescript, axios, fetch code",
      "ko": "스웨거 크롬 익스텐션은 Swagger UI를 개선하여 더 직관적으로 표시합니다. API 문서를 더 읽기 쉽고 사용자 친화적인 방식으로 표시하여 개발자가 API를 이해하고 사용하기 쉽도록 도와줍니다.\n\nAPI 검색 기능: 익스텐션은 API를 검색할 수 있는 기능을 제공합니다. 개발자는 특정 API나 엔드포인트를 빠르게 찾아볼 수 있으며, 검색 결과에서 원하는 API에 빠르게 액세스할 수 있습니다.\n\n타입 생성기: JSON 확장 형식을 기반으로 API 응답 데이터의 타입을 자동으로 생성합니다. 개발자는 응답 데이터를 분석하고 타입 정의를 생성하는 번거로움 없이 자동으로 생성된 타입을 활용할 수 있습니다.\n\nAxios를 사용한 API 코드 생성기: 익스텐션은 Axios를 사용하여 API 호출에 대한 코드를 자동으로 생성합니다. 개발자는 API 요청을 더 쉽게 구현할 수 있으며 일관된 코드 스타일과 구조를 유지할 수 있습니다.\n\nFetch를 사용한 API 코드 생성기: 익스텐션은 Fetch API를 사용하여 API 호출에 대한 코드를 자동으로 생성합니다. Fetch를 사용하면 개발자는 더 간결하게 API 요청을 작성하고 선택적으로 Axios와 함께 사용할 수 있습니다.\n\n이 익스텐션은 이러한 기능을 포함하여 개발자가 API 작업을 더 효율적으로 수행할 수 있도록 도와줍니다. 익스텐션을 설치하고 사용함으로써 API 관련 작업의 생산성을 향상시킬 수 있으며 개발 프로세스를 더 원활하고 편리하게 만들 수 있습니다."
    },
    "description": {
      "en": "Improvement of the Swagger UI: This extension shows the Swagger UI more intuitively.\nDisplay API documents in a more readable and user-friendly way, making it easier for developers to understand and use APIs.\n\nAPI search capability: Extension provides the ability to search for APIs. Developers can quickly browse specific APIs or endpoints, and search results can quickly access the APIs they want.\n\nType generator: Automatically generates the type of API response data based on the JSON extension format. Developers can leverage automatically generated types without the need to easily analyze response data and create type definitions.\n\nAPI code generator using Axios: Extension automatically generates code for API calls using Axios. Developers can implement API requests more easily and maintain a consistent code style and structure.\n\nAPI code generator using fetch: Extension uses fetch API to automatically generate code for API calls. Using fetch, developers can write API requests more concisely and optionally with axios.\n\nThis extension, including these features, helps developers perform API tasks more efficiently. Installing and using extensions can improve the productivity of API-related tasks and make the development process smoother and more convenient.",
      "ko": "Swagger UI의 개선: 이 익스텐션은 Swagger UI를 더 직관적으로 표시합니다. API 문서를 더 읽기 쉽고 사용자 친화적인 방식으로 표시하여 개발자가 API를 이해하고 사용하기 쉽도록 도와줍니다.\n\nAPI 검색 기능: 익스텐션은 API를 검색할 수 있는 기능을 제공합니다. 개발자는 특정 API나 엔드포인트를 빠르게 찾아볼 수 있으며, 검색 결과에서 원하는 API에 빠르게 액세스할 수 있습니다.\n\n타입 생성기: JSON 확장 형식을 기반으로 API 응답 데이터의 타입을 자동으로 생성합니다. 개발자는 응답 데이터를 분석하고 타입 정의를 생성하는 번거로움 없이 자동으로 생성된 타입을 활용할 수 있습니다.\n\nAxios를 사용한 API 코드 생성기: 익스텐션은 Axios를 사용하여 API 호출에 대한 코드를 자동으로 생성합니다. 개발자는 API 요청을 더 쉽게 구현할 수 있으며 일관된 코드 스타일과 구조를 유지할 수 있습니다.\n\nFetch를 사용한 API 코드 생성기: 익스텐션은 Fetch API를 사용하여 API 호출에 대한 코드를 자동으로 생성합니다. Fetch를 사용하면 개발자는 더 간결하게 API 요청을 작성하고 선택적으로 Axios와 함께 사용할 수 있습니다.\n\n이 익스텐션은 이러한 기능을 포함하여 개발자가 API 작업을 더 효율적으로 수행할 수 있도록 도와줍니다. 익스텐션을 설치하고 사용함으로써 API 관련 작업의 생산성을 향상시킬 수 있으며 개발 프로세스를 더 원활하고 편리하게 만들 수 있습니다."
    }
  }
}
